Revit 2024 API
View.HasViewTransforms Method
 Returns true if the view reports model space to view projection space transforms.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool HasViewTransforms()
Visual Basic
Public Function HasViewTransforms As Boolean
Visual C++
public:
bool HasViewTransforms()
Return Value
 True if the view returns transforms, false otherwise.
Remarks
 Not all views return transforms. For example, schedules and legends do not report transforms.
See Also
View Class
Autodesk.Revit.DB Namespace